adding final report for HW5
