--- a/Homeworks/Project/report.md
+++ b/Homeworks/Project/report.md
@@ -162,282 +220,368 @@ Link: https://gomockingbird.com/projects/v95sylo/4gXVnC
-```
 ### Class diagrams
 
-```mermaid
-classDiagram
+Examples: https://i.imgur.com/ZjBaYwR.png
 
-class Tile
-Tile: +y: Int
-Tile: +y: Int
-
-class Path
-Path: +tiles: ArrayList<Tile>
-Path: +getDeparture(): Tile
-Path: +getDestination(): Tile
-
-class Algorithm
-Algorithm: +name: String
-Algorithm: +visitedTiles: ArrayList<Tile>
-Algorithm: +computeOptimalPath(start: Tile, end: Tile): Path
-Algorithm: +getVisitedTiles(): ArrayList<Tile>
@@
 
 
-class Color
-Color: +rgb: Int
+```plantuml
+@startuml
+class Tile{
+ + x: Int
+ + y: Int
+}
 
-class AlgorithmStats
-AlgorithmStats: +algorithmName: String
-AlgorithmStats: +runtime: Long
-AlgorithmStats: +ramUsage: Long
-AlgorithmStats: +pathLength: Int
-AlgorithmStats: +visitedTiles: Int
+class Path{
++tiles: ArrayList<Tile>
++getDeparture(): Tile
++getDestination(): Tile
+}
 
-class GridTile
-GridTile: +color: Color
-GridTile: +position: Tile
-GridTile: +collisionFlag: Int
+abstract class Algorithm{
++computeOptimalPath(start: Tile, end: Tile): Path
++getVisitedTiles(): ArrayList<Tile>
+}
 
-class Grid
-Grid: +tiles: ArrayList<GridTile>
-Grid: +updateGrid(tiles: ArrayList<GridTile>)
-Grid: -colorTile(tile: Tile, color: Color)
-Grid: +clearGraph()
+Class AStar{
++name: String
++visitedTiles: ArrayList<Tile>
++computeOptimalPath(start: Tile, end: Tile): Path
++getVisitedTiles(): ArrayList<Tile>
+}
 
-class AlgorithmController
-AlgorithmController: +startPosition: Tile
-AlgorithmController: +endPosition: Tile
-AlgorithmController: +history: ArrayList<Tile[]>
-AlgorithmController: +enabledAlgorithms: Map<String,Boolean>
-AlgorithmController: +gridData: Grid
-AlgorithmController: +latestAlgorithmStats: ArrayList<AlgorithmStats>
-AlgorithmController: +algorithms: ArrayList<Algorithm>
+AStar .u.|> Algorithm
 
-AlgorithmController: +runSimulation(test:String)
-AlgorithmController: +setStartPosition(tile: Tile)
-AlgorithmController: +endStartPosition(tile: Tile)
-AlgorithmController: +setAlgorithmEnabled(algorithmName: String)
-AlgorithmController: +generateRandomPositions()
+Class IDAStar{
++name: String
++visitedTiles: ArrayList<Tile>
++computeOptimalPath(start: Tile, end: Tile): Path
++getVisitedTiles(): ArrayList<Tile>
+}
+IDAStar .u.|> Algorithm
 
-class GUI
-GUI: +updateStartPosition(tile: Tile)
-GUI: +updateEndPosition(tile: Tile)
-GUI: +updateHistory(history: ArrayList<Tile[]>)
-GUI: +updateEnabledAlgorithms(enabledAlgorithms: Map<String,Boolen>)
-GUI: +refreshGrid(grid:Grid)
-GUI: +updateAlgoStats(stats: ArrayList<AlgorithmStats>)
+Class BreadthFirstSearch{
++name: String
++visitedTiles: ArrayList<Tile>
++computeOptimalPath(start: Tile, end: Tile): Path
++getVisitedTiles(): ArrayList<Tile>
+}
+BreadthFirstSearch .u.|> Algorithm
 
-AlgorithmController *-- "1..1" Grid
-Grid *-- "1..*" GridTile
+Class DepthFirstSearch{
++name: String
++visitedTiles: ArrayList<Tile>
++computeOptimalPath(start: Tile, end: Tile): Path
++getVisitedTiles(): ArrayList<Tile>
+}
+DepthFirstSearch .l.|> Algorithm
+
+class AlgorithmStats{
++algorithmName: String
++runtime: Long
++ramUsage: Long
++pathLength: Int
++visitedTiles: Int
+}
+
+class GridTile{
++color: Color
++position: Tile
++collisionFlag: Int
+}
+
+class GridModel{
++tiles: ArrayList<GridTile>
++updateGrid(tiles: ArrayList<GridTile>)
+-colorTile(tile: Tile, color: Color)
++clearGraph()
+}
+
+class AlgorithmController{
++startPosition: Tile
++endPosition: Tile
++history: ArrayList<Tile[]>
++enabledAlgorithms: Map<String,Boolean>
++gridData: GridModel
++latestAlgorithmStats: ArrayList<AlgorithmStats>
++algorithms: ArrayList<Algorithm>
+
++runSimulation(test:String)
++setStartPosition(tile: Tile)
++endStartPosition(tile: Tile)
++setAlgorithmEnabled(algorithmName: String)
++generateRandomPositions()
+}
+class JFrame{}
+class JButton{}
+class JField{}
+class JLabel{}
+class JTable{}
+class JCheckBox{}
+class JPane{}
+
+class GUIView << (S,#FF7700) Singleton >>{
++mainContainer: JFrame
++grid: JComponent
++generateRandomStartEndPositionsButton: JButton
++generateRandomGridButton: JButton
++generateNewGraph: JButton
++computePathButton: JButton
++comparisonAlgoTable: JTable
++algoSelectedCheckBoxes: ArrayList<JCheckBox>
++TODO - add all jFrames and JLables and such
++TODO - add functions to add the buttons and such
++updateStartPosition(tile: Tile)
++updateEndPosition(tile: Tile)
++updateHistory(history: ArrayList<Tile[]>)
++updateEnabledAlgorithms(enabledAlgorithms: Map<String,Boolen>)
++refreshGrid(gridModel:GridModel)
++updateAlgoStats(stats: ArrayList<AlgorithmStats>)
+}
+
+AlgorithmController o-- "1..1" GridModel
+GridModel *-- "1..*" GridTile
 GridTile --|> Tile : Inhertance
-GridTile o-- "1.1" Color
+
 
  
-AlgorithmController *-- "1.*" Algorithm
+AlgorithmController o-- "1.*" Algorithm
 Algorithm ..> Path
 Path o-- "2..*" Tile
-AlgorithmController ..> GUI
-AlgorithmController *-- "1.*" AlgorithmStats
-```
 
+GUIView ..> GridModel
+GUIView ..> Tile
+GUIView ..> AlgorithmStats
+JButton -up-> "1..5" ActionListner
+GUIView *-up- "1..1" JFrame
+GUIView *-up- "1..*" JButton
+GUIView *-up- "1..*" JField
+GUIView *-up- "1..*" JLabel
+GUIView *-up- "1..*" JTable
+GUIView *-up- "1..*" JCheckBox
+GUIView *-up- "1..1" JPane
+
+AlgorithmController .up.|>  ActionListner
+AlgorithmController o-- "1.*" AlgorithmStats
+AlgorithmController ..> Tile
+
+
+@enduml
+```
 ### Sequence Diagrams
 
 #### Path found
@@
 ### State Diagrams
+
 #### Path Found
-```mermaid
-stateDiagram
-[*] --> Inilization
-Inilization --> Ready : Enter Start and End positions
+
+```plantuml
+@startuml
+[*] --> Initialization
+Initialization : Generates blocked tiles and areas
+Initialization --> Ready : Enter Start and End positions
 Ready --> Processing : Press compute path
 Processing --> Complete : Display results
-Complete --> Inilization : Restart
+Complete --> Initialization : Restart
+@enduml
 ```
 #### Computer Generated Path found
-```mermaid
-stateDiagram
-[*] --> Inilization
-Inilization --> Ready : Press Generate start/end positions
+
+```plantuml
+@startuml
+[*] --> Initialization
+Initialization : Generates blocked tiles and areas
+Initialization --> Ready : Press Generate start/end positions
 Ready --> Processing : Press compute path
 Processing --> Complete : Display results
-Complete --> Inilization : Restart
+Complete --> Initialization : Restart
+@enduml
 ```
 
-#### Select Different Algorithm
-```mermaid
-stateDiagram
-[*] --> Inilization
-Inilization --> Inilization : Select algorithms
-
-```
 #### Path not found found
-```mermaid
-stateDiagram
-[*] --> Inilization
-Inilization --> Ready : Enter Start and End positions
+
+```plantuml
+@startuml
+[*] --> Initialization
+Initialization : Generates blocked tiles and areas
+Initialization --> Ready : Enter Start and End positions
 Ready --> Processing : Press compute path
 Processing --> Complete : Display no path found
-Complete --> Inilization : Restart
+Complete --> Initialization : Restart
+@enduml
 ```
+
+#### Generate new Graph
+
